tutorials/D4DummySetup/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

x0 1;
y0 1;
z0 1;

resx 100;
resy 100;
resz 100;

vertices
(
   (0   0   0  )    // 0
   ($x0 0   0  )    // 1
   ($x0 $y0 0  )    // 2
   (0   $y0 0  )    // 3
   (0   0   $z0)    // 4
   ($x0 0   $z0)    // 5
   ($x0 $y0 $z0)    // 6
   (0   $y0 $z0)    // 7
);

blocks
(
    hex (0  1  2  3  4  5  6  7)   ($resx $resy $resz)  simpleGrading (1 1 1)  
);

edges
();

boundary
(
    chamber
    {
        type patch;
        faces
        (
            (0 1 2 3)
            (1 5 6 2)
            (5 4 7 6)
            (0 3 7 4)
            (0 4 5 1)
            (3 2 6 7)
        );
    }
);

// ************************************************************************* //
